sysbench-runs/series01/res6/sysbench.16.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from timer.

Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 16, tps: 5512.05, reads/s: 77191.11, writes/s: 22048.20 response time: 7.68ms (99%)
[  20s] threads: 16, tps: 5670.72, reads/s: 79383.50, writes/s: 22683.08 response time: 6.86ms (99%)
[  30s] threads: 16, tps: 5514.76, reads/s: 77208.71, writes/s: 22059.46 response time: 7.06ms (99%)
[  40s] threads: 16, tps: 5623.66, reads/s: 78727.78, writes/s: 22494.55 response time: 6.12ms (99%)
[  50s] threads: 16, tps: 5298.45, reads/s: 74180.65, writes/s: 21194.02 response time: 9.49ms (99%)
[  60s] threads: 16, tps: 5141.17, reads/s: 71976.32, writes/s: 20564.56 response time: 10.76ms (99%)
[  70s] threads: 16, tps: 5261.23, reads/s: 73659.48, writes/s: 21045.34 response time: 10.39ms (99%)
[  80s] threads: 16, tps: 4892.40, reads/s: 68489.93, writes/s: 19568.91 response time: 14.49ms (99%)
[  90s] threads: 16, tps: 5272.39, reads/s: 73820.77, writes/s: 21090.96 response time: 10.49ms (99%)
[ 100s] threads: 16, tps: 5109.01, reads/s: 71519.33, writes/s: 20434.74 response time: 11.82ms (99%)
[ 110s] threads: 16, tps: 5368.50, reads/s: 75161.40, writes/s: 21474.00 response time: 10.85ms (99%)
[ 120s] threads: 16, tps: 5113.09, reads/s: 71582.97, writes/s: 20452.66 response time: 11.84ms (99%)
[ 130s] threads: 16, tps: 5049.74, reads/s: 70695.61, writes/s: 20198.78 response time: 11.53ms (99%)
[ 140s] threads: 16, tps: 4818.86, reads/s: 67465.41, writes/s: 19275.53 response time: 21.71ms (99%)
[ 150s] threads: 16, tps: 5003.90, reads/s: 70051.49, writes/s: 20016.00 response time: 11.84ms (99%)
[ 160s] threads: 16, tps: 4536.40, reads/s: 63513.95, writes/s: 18146.28 response time: 19.76ms (99%)
[ 170s] threads: 16, tps: 4652.61, reads/s: 65130.47, writes/s: 18610.42 response time: 15.63ms (99%)
[ 180s] threads: 16, tps: 4290.70, reads/s: 60075.51, writes/s: 17163.40 response time: 15.70ms (99%)
[ 190s] threads: 16, tps: 4206.10, reads/s: 58879.59, writes/s: 16822.10 response time: 13.93ms (99%)
[ 200s] threads: 16, tps: 4500.58, reads/s: 63011.15, writes/s: 18003.33 response time: 11.98ms (99%)
[ 210s] threads: 16, tps: 4345.34, reads/s: 60837.40, writes/s: 17381.37 response time: 13.51ms (99%)
[ 220s] threads: 16, tps: 4684.17, reads/s: 65575.10, writes/s: 18736.18 response time: 10.33ms (99%)
[ 230s] threads: 16, tps: 4516.59, reads/s: 63232.40, writes/s: 18066.77 response time: 11.28ms (99%)
[ 240s] threads: 16, tps: 4411.42, reads/s: 61759.14, writes/s: 17646.47 response time: 13.33ms (99%)
[ 250s] threads: 16, tps: 4531.69, reads/s: 63445.22, writes/s: 18125.98 response time: 11.62ms (99%)
[ 260s] threads: 16, tps: 4529.61, reads/s: 63416.08, writes/s: 18118.92 response time: 12.62ms (99%)
[ 270s] threads: 16, tps: 4566.65, reads/s: 63932.29, writes/s: 18266.10 response time: 12.16ms (99%)
[ 280s] threads: 16, tps: 4363.50, reads/s: 61087.75, writes/s: 17454.48 response time: 11.82ms (99%)
[ 290s] threads: 16, tps: 4766.76, reads/s: 66733.80, writes/s: 19066.93 response time: 10.73ms (99%)
[ 300s] threads: 16, tps: 4295.30, reads/s: 60128.28, writes/s: 17179.89 response time: 11.91ms (99%)
[ 310s] threads: 16, tps: 4283.60, reads/s: 59974.10, writes/s: 17134.50 response time: 11.99ms (99%)
[ 320s] threads: 16, tps: 4181.90, reads/s: 58549.20, writes/s: 16728.00 response time: 14.03ms (99%)
[ 330s] threads: 16, tps: 4341.30, reads/s: 60771.70, writes/s: 17365.00 response time: 12.47ms (99%)
[ 340s] threads: 16, tps: 4187.10, reads/s: 58631.41, writes/s: 16749.00 response time: 22.76ms (99%)
[ 350s] threads: 16, tps: 4084.49, reads/s: 57177.84, writes/s: 16337.45 response time: 34.91ms (99%)
[ 360s] threads: 16, tps: 4081.71, reads/s: 57146.28, writes/s: 16328.35 response time: 40.79ms (99%)
[ 370s] threads: 16, tps: 4113.10, reads/s: 57585.08, writes/s: 16453.69 response time: 13.96ms (99%)
[ 380s] threads: 16, tps: 4195.60, reads/s: 58735.30, writes/s: 16780.00 response time: 36.69ms (99%)
[ 390s] threads: 16, tps: 4204.36, reads/s: 58866.19, writes/s: 16818.16 response time: 44.05ms (99%)
[ 400s] threads: 16, tps: 4203.70, reads/s: 58851.74, writes/s: 16816.18 response time: 44.93ms (99%)
[ 410s] threads: 16, tps: 4597.72, reads/s: 64360.39, writes/s: 18388.28 response time: 11.58ms (99%)
[ 420s] threads: 16, tps: 4595.60, reads/s: 64339.95, writes/s: 18382.71 response time: 11.56ms (99%)
[ 430s] threads: 16, tps: 4824.42, reads/s: 67543.97, writes/s: 19297.98 response time: 9.69ms (99%)
[ 440s] threads: 16, tps: 4617.58, reads/s: 64641.71, writes/s: 18469.62 response time: 10.74ms (99%)
[ 450s] threads: 16, tps: 4488.12, reads/s: 62832.00, writes/s: 17952.69 response time: 11.95ms (99%)
[ 460s] threads: 16, tps: 4479.84, reads/s: 62720.18, writes/s: 17918.97 response time: 11.82ms (99%)
[ 470s] threads: 16, tps: 4635.33, reads/s: 64902.45, writes/s: 18542.73 response time: 11.41ms (99%)
[ 480s] threads: 16, tps: 4919.13, reads/s: 68860.02, writes/s: 19675.52 response time: 10.41ms (99%)
[ 490s] threads: 16, tps: 4376.28, reads/s: 61271.98, writes/s: 17506.91 response time: 13.67ms (99%)
[ 500s] threads: 16, tps: 4158.66, reads/s: 58221.58, writes/s: 16633.12 response time: 20.80ms (99%)
[ 510s] threads: 16, tps: 4166.74, reads/s: 58330.72, writes/s: 16666.58 response time: 14.11ms (99%)
[ 520s] threads: 16, tps: 4371.59, reads/s: 61209.22, writes/s: 17487.95 response time: 11.94ms (99%)
[ 530s] threads: 16, tps: 4319.04, reads/s: 60458.79, writes/s: 17275.74 response time: 12.76ms (99%)
[ 540s] threads: 16, tps: 4276.72, reads/s: 59876.80, writes/s: 17105.39 response time: 12.92ms (99%)
[ 550s] threads: 16, tps: 4242.31, reads/s: 59389.91, writes/s: 16970.63 response time: 14.61ms (99%)
[ 560s] threads: 16, tps: 4284.54, reads/s: 59991.01, writes/s: 17138.07 response time: 24.54ms (99%)
[ 570s] threads: 16, tps: 4817.70, reads/s: 67440.66, writes/s: 19269.72 response time: 10.56ms (99%)
[ 580s] threads: 16, tps: 4482.62, reads/s: 62756.71, writes/s: 17930.59 response time: 14.32ms (99%)
[ 590s] threads: 16, tps: 4548.00, reads/s: 63671.87, writes/s: 18192.19 response time: 16.15ms (99%)
[ 600s] threads: 16, tps: 4840.90, reads/s: 67779.89, writes/s: 19363.90 response time: 12.02ms (99%)
OLTP test statistics:
    queries performed:
        read:                            38887450
        write:                           11110700
        other:                           5555350
        total:                           55553500
    transactions:                        2777675 (4629.39 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 49998150 (83329.09 per sec.)
    other operations:                    5555350 (9258.79 per sec.)

General statistics:
    total time:                          600.0083s
    total number of events:              2777675
    total time taken by event execution: 9596.0770s
    response time:
         min:                                  1.85ms
         avg:                                  3.45ms
         max:                                190.38ms
         approx.  99 percentile:              12.33ms

Threads fairness:
    events (avg/stddev):           173604.6875/817.51
    execution time (avg/stddev):   599.7548/0.00